---
kind: property
id: P:Autodesk.Revit.DB.CurveArrArray.IsEmpty
source: html/02178f6b-3dfe-c9f2-cbfe-43c4432797b7.htm
---
# Autodesk.Revit.DB.CurveArrArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.